{
  "codex.form.my_addon.familiar_fox_sp.title": "\n‘When the curse melds completely with the Moon Marrow, you are no longer merely a familiar...\nYou are the agent of the Spirit Realm, the master of the Pale Blue Flames’\n\nExclusive Trinket/Tool: [Guardian Anklet]",
  "codex.form.my_addon.familiar_fox_sp.appearance": "You have transcended the boundaries of mortal creatures, transformed into a vessel of pure magical energy.\nPale blue fox fires orbit you not just as flickers, but pulsating like breath.\nYour fur bears patterns of deep crimson interwoven with pristine moonlight white, as if moonbeams were woven directly into your body.\nGhostly afterimages trail behind your movements.\nYour eyes burn with an unquenchable spectral blue fire, gazing upon the boundary between the living and the dead.",
  "codex.form.my_addon.familiar_fox_sp.pros": "Lord of Spirits\nThe magic within you has ascended to a higher form, granting you unparalleled power:\n\nBlue Fire Ring: Press the Primary Ability key to activate a ring of pale blue fire around you. It continuously consumes mana to damage and inflict severe burning on surrounding enemies. While active, your Soul Harvest ability is greatly enhanced.\n\nFox Fire Breath: Press the Secondary Ability key to consume mana and exhale a devastating stream of soul fox fire, dealing instant damage and igniting enemies for a long duration.\n\nSoul Harvest: As a spirit creature, you draw power from fading lives. Killing targets restores a large amount of mana. If the Blue Fire Ring is active, kills also restore Health.\n\nMana Siphon: You can sneak and right-click living creatures to siphon their life essence directly, granting you healing, saturation, or special materials depending on the target.\n\nSpirit Incarnation: You are no longer mere flesh and blood. You are immune to physiological debuffs like Poison, Hunger, and Nausea. Ordinary fire cannot harm you.\n\nFurthermore, you retain all basic Familiar abilities: Illagers view you as an ally, you can sense entities, and move freely through Sweet Berry bushes.",
  "codex.form.my_addon.familiar_fox_sp.cons": "Immense power demands a heavy price to maintain:\n\nAs a high-ranking spirit, your dependency on mana is even more severe. When mana is depleted, you suffer not only Blindness and Weakness but also continuous, excruciating pain.\n\nAlthough immune to mundane fire, flames that originate from the soul—Soul Fire—can still harm you.\n\nYour physical structure remains fragile; your health is no higher than that of a common familiar.\nYou cannot equip leggings or boots, and you move sluggishly in water.\n\nMost conventional food means nothing to you; you must rely on plundering life force or mana siphoning to sustain your existence.\nVillagers fear you not just as a monster, but shun you as if you were a ghost or deity.",
  "codex.form.my_addon.familiar_fox_sp.instincts": "Your mind has never been clearer; your instincts are fully under the command of your will.\nYet, in the depths of your soul, you crave more mana, more life essence...\nIs this truly your will, or the hunger of the power itself?",
  "power.my_addon.form_familiar_fox_sp_kill_mana.name": "Soul Harvest",
  "power.my_addon.form_familiar_fox_sp_kill_mana.description": "Recover 15 mana after killing a target. If Blue Fire Ring is active, recover an additional 5 mana and 3 health.",
  "power.my_addon.form_familiar_fox_sp_blue_fire_ring.name": "Blue Fire Ring",
  "power.my_addon.form_familiar_fox_sp_blue_fire_ring.description": "Requires full mana to activate. Consumes mana per second to damage and ignite surroundings. Enhances kill recovery when active.",
  "power.my_addon.form_familiar_fox_sp_fox_fire_breath.name": "Fox Fire Breath",
  "power.my_addon.form_familiar_fox_sp_fox_fire_breath.description": "Consumes 25 mana to breathe soul fox fire forward, causing 6 damage and igniting enemies for 10 seconds.",
  "power.my_addon.form_familiar_fox_sp_absorb.name": "Mana Siphon",
  "power.my_addon.form_familiar_fox_sp_absorb.description": "Sneak and right-click a creature to consume mana and siphon its life essence. Depending on the target, you can gain healing, restore hunger, or obtain special materials.",
  "power.my_addon.form_familiar_fox_sp_no_buff_effect.name": "Spirit Incarnation",
  "power.my_addon.form_familiar_fox_sp_no_buff_effect.description": "As a powerful spirit creature, you are immune to conventional negative states such as poison, hunger, and nausea, and you will not take damage from fire (though you still fear Soul Fire).",
  "effect.ssc_addon.fox_fire_burn": "Fox Fire Burn",
  "key.ssc_addon.fox_fire": "Fox Fire Breath",
  "key.ssc_addon.blue_ring": "Blue Fire Ring",
  "key.categories.ssc_addon": "Shape Shifter Curse Addon",
  "item.ssc_addon.sp_upgrade_thing": "Moon Marrow Cross-Ring",
  "item.ssc_addon.sp_upgrade_thing.tooltip": "A cross-ring condensed from moonlight, allowing you to bear even more curses.",
  "message.ssc_addon.evolution.success": "“Very well...” The moonlight whispers in your mind, closer and clearer than ever. With the whisper comes an unparalleled sense of power. You embraced evolution, which means you embraced a deeper hug of the curse. It is a dangerous symbiosis, and you can no longer separate.",
  "message.ssc_addon.evolution.fail.no_moon": "The metamorphosis to the essence requires the cursed moonlight as the final key. At this moment, the keyhole is empty—the evolutionary process has fallen into silence.",
  "message.ssc_addon.evolution.fail.bad_form": "The current form is insufficient to carry the echoes of the older contract. Evolution refuses to resonate in the depths of the bloodline, and a deeper link cannot be established.",
  "message.ssc_addon.evolution.fail.both": "The foundation of the form is too shallow, and the rain of the curse has not fallen. In this double barrenness, the seedlings of evolution have withered irretrievably.",
  "message.ssc_addon.evolution.fail.already_sp": "Your attempt to forge a deeper link with the moonlight has triggered a fatal resonance. Your form not only rejected the evolution but reflected the curse's power in full—amidst the violent backlash, you have become nothing more than a fleeting, piercing echo beneath the Cursed Moon.",
  "death.attack.cursed_erosion": "%1$s was eroded by the power of the Cursed Moon",
  "death.attack.cursed_burst": "%1$s was burst by the power of the Cursed Moon"
}